1. If you provide a Point-to-point transport service as a driver, you must ___
1. Consume food and smoke in your car
2. Challenge passengers to complain against LTA
3. Start an argument with a passenger
4. Not do all the above
2. Who regulates the fare structure for taxi services?
1. Land Transport Authority (LTA)
2. Union
3. Public Transport Council (PTC)
4. Taxi driver
3. Which of the following is part of the Code of Conduct for Point-to-Point transport operator?
1. To dress professionally, in collar shirt, tailored pants and covered shoes
2. To be friendly, courteous, and helpful
3. To smile and practise safe driving habits always
4. All of the above
4. Which of the following is the attribute of a street-hail and a ride-hail driver?
1. I provide service to all passengers, regardless of their race, language or religion
2. I will challenge my passengers to a fight who argue with me
3. I will speed to get to the destination
4. I will comply with all traffic rules only when enforcement officer is present
5. What do you understand by the term "a street-hail service" in Singapore?
1. A service where flagging down a taxi at a taxi stand is allowed
2. A service where flagging down a taxi at a bus-stop
3. When booking of taxi is only by using a mobile app
4. When you can book a taxi by calling a Private Hire Car operator number


6. If one of the tyres of your Taxi is blown out, what must you do?
1. Sit in the car and wait for help.
2. Call upon other car drivers to help you.
3. You must change it even if you do not know how to do it.
4. Change the tyre if possible. If not, seek help by calling the Automobile Association or get help from other taxi drivers.
7. How do you keep clean your taxi or private hire car?
1. Wash and clean the car exterior
2. Wipe clean and sanitised the car interior
1. Clear all wastes in the car to ensure it is free of cockroaches and ants
4. All the above
8. What are the guidelines to be followed to ensure the safety of the passengers?
1. Slow down and drive carefully over the road tumps. Do not overtake
2. Inform passengers that they must wear safety belt for their safety
3. Do not carry more passengers beyond what is allowed in your vehicle
4. All of the above
9. Which is NOT an occupational health hazard to a Taxi driver?
1. Pain to backbone, neck, or head
2. Fatigue and stress
3. Sleep deprivation (lack of sleep)
4. Toothache
10. Which of the following are symptoms of diabetes?
1. Frequent urination, thirst, and hunger
2. Blurred vision
3. Numb or tingling in hands or fest
4. All of the above
11. Which of the following aid in avoiding collision with vehicle ahead?
1. Staying alert
2. Keep a safe distance from the vehicle ahead
3. Do not tailgate the vehicle in front of you
4. All of the above
12. Which of the following should be done if an accident causing injuries happens?
1. Do not panic.
2. Call the Police at 999 or 995 for ambulance
3. Inform your operator company and the insurance company of the accident within 24 hours, or by the next working day
4. All of the above
13. For a street-hail or a ride-hail driver, fatigue can lead to
1. Driver becoming more alert and drive carefully
2. Driver falling asleep at the wheel and resulting in road accidents.
3. Lowering body stress and anxiety
4. Driver talking louder and louder
14. Who is responsible for the passenger's safety in the taxi or private hire car?
1. The passenger
2. The driver
3. Service provider operators
4. Traffic Police
15. What should you do when your vehicle has broken down or stalled?
1. Move it to the road shoulder if possible
2. Switch on the hazard lights
3. Place the breakdown-warning triangle at least 20m behind the vehicle
4. All of the above 
16. What is the first thing you must do if a passenger has fainted in your vehicle?
1. Carry the passenger out of your car
2. Drive your car to the side of the road and call your operator company
3. Help to revive the passenger with medical oil
4. Search the body of the passenger for a handphone to call his or her family.
17. According to LTA's IVRD (in-vehicle recording devices) guidelines, the driver is NOT allowed to use ___ for personal gain.
1. The communication between passengers talking in the car
2. Recorded video and audio of passengers
3. The photo of passengers
4. All of the above
18. In communicating with the passenger, the driver should _____
1. Sense the need to talk to the passenger
2. Keep on talking and explaining
3. Show gestures as much as possible
4. Turn his head behind and talk to passenger all the time
19. What should you do when you notice your passenger is on a wheelchair?
1. Just ignore it and do nothing
2. Pretend you didn't see it
3. Get out of the car and offer your help
4. Tell the passenger not to take your vehicle.
20. What should you say/do with the change after you have collected cash payment from a passenger before he alights from the taxi?
1. Keep the change quietly
2. "Sir/Mdm, your change”
3. "Sir/Mdm, can I keep the change?"
4. "Sir/Mam, can you donate the change?"